{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"name": "unet", "output_layers": ["activation_29", 0, 0], "input_layers": ["input_2", 0, 0], "layers": [{"config": {"batch_input_shape": [null, 128, 128, 128, 1], "name": "input_2", "sparse": false, "dtype": "float32"}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"filters": 16, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_15", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_15", "class_name": "Conv3D", "inbound_nodes": [["input_2", 0, 0, {}]]}, {"config": {"name": "activation_15", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_15", "class_name": "Activation", "inbound_nodes": [["conv3d_15", 0, 0, {}]]}, {"config": {"filters": 32, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_16", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_16", "class_name": "Conv3D", "inbound_nodes": [["activation_15", 0, 0, {}]]}, {"config": {"name": "activation_16", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_16", "class_name": "Activation", "inbound_nodes": [["conv3d_16", 0, 0, {}]]}, {"config": {"data_format": "channels_last", "dtype": "float32", "padding": "valid", "name": "max_pooling3d_3", "pool_size": [2, 2, 2], "strides": [2, 2, 2], "trainable": true}, "name": "max_pooling3d_3", "class_name": "MaxPooling3D", "inbound_nodes": [["activation_16", 0, 0, {}]]}, {"config": {"filters": 32, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_17", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_17", "class_name": "Conv3D", "inbound_nodes": [["max_pooling3d_3", 0, 0, {}]]}, {"config": {"name": "activation_17", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_17", "class_name": "Activation", "inbound_nodes": [["conv3d_17", 0, 0, {}]]}, {"config": {"filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_18", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_18", "class_name": "Conv3D", "inbound_nodes": [["activation_17", 0, 0, {}]]}, {"config": {"name": "activation_18", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_18", "class_name": "Activation", "inbound_nodes": [["conv3d_18", 0, 0, {}]]}, {"config": {"data_format": "channels_last", "dtype": "float32", "padding": "valid", "name": "max_pooling3d_4", "pool_size": [2, 2, 2], "strides": [2, 2, 2], "trainable": true}, "name": "max_pooling3d_4", "class_name": "MaxPooling3D", "inbound_nodes": [["activation_18", 0, 0, {}]]}, {"config": {"filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_19", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_19", "class_name": "Conv3D", "inbound_nodes": [["max_pooling3d_4", 0, 0, {}]]}, {"config": {"name": "activation_19", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_19", "class_name": "Activation", "inbound_nodes": [["conv3d_19", 0, 0, {}]]}, {"config": {"filters": 128, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_20", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_20", "class_name": "Conv3D", "inbound_nodes": [["activation_19", 0, 0, {}]]}, {"config": {"name": "activation_20", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_20", "class_name": "Activation", "inbound_nodes": [["conv3d_20", 0, 0, {}]]}, {"config": {"data_format": "channels_last", "dtype": "float32", "padding": "valid", "name": "max_pooling3d_5", "pool_size": [2, 2, 2], "strides": [2, 2, 2], "trainable": true}, "name": "max_pooling3d_5", "class_name": "MaxPooling3D", "inbound_nodes": [["activation_20", 0, 0, {}]]}, {"config": {"filters": 128, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_21", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_21", "class_name": "Conv3D", "inbound_nodes": [["max_pooling3d_5", 0, 0, {}]]}, {"config": {"name": "activation_21", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_21", "class_name": "Activation", "inbound_nodes": [["conv3d_21", 0, 0, {}]]}, {"config": {"filters": 256, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_22", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_22", "class_name": "Conv3D", "inbound_nodes": [["activation_21", 0, 0, {}]]}, {"config": {"name": "activation_22", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_22", "class_name": "Activation", "inbound_nodes": [["conv3d_22", 0, 0, {}]]}, {"config": {"filters": 256, "kernel_constraint": null, "data_format": "channels_last", "output_padding": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [2, 2, 2], "dtype": "float32", "use_bias": true, "trainable": true, "kernel_size": [2, 2, 2], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_transpose_3", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_transpose_3", "class_name": "Conv3DTranspose", "inbound_nodes": [["activation_22", 0, 0, {}]]}, {"config": {"name": "concatenate_3", "axis": -1, "trainable": true, "dtype": "float32"}, "name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["activation_20", 0, 0, {}], ["conv3d_transpose_3", 0, 0, {}]]]}, {"config": {"filters": 128, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_23", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_23", "class_name": "Conv3D", "inbound_nodes": [["concatenate_3", 0, 0, {}]]}, {"config": {"name": "activation_23", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_23", "class_name": "Activation", "inbound_nodes": [["conv3d_23", 0, 0, {}]]}, {"config": {"filters": 128, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_24", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_24", "class_name": "Conv3D", "inbound_nodes": [["activation_23", 0, 0, {}]]}, {"config": {"name": "activation_24", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_24", "class_name": "Activation", "inbound_nodes": [["conv3d_24", 0, 0, {}]]}, {"config": {"filters": 128, "kernel_constraint": null, "data_format": "channels_last", "output_padding": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [2, 2, 2], "dtype": "float32", "use_bias": true, "trainable": true, "kernel_size": [2, 2, 2], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_transpose_4", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_transpose_4", "class_name": "Conv3DTranspose", "inbound_nodes": [["activation_24", 0, 0, {}]]}, {"config": {"name": "concatenate_4", "axis": -1, "trainable": true, "dtype": "float32"}, "name": "concatenate_4", "class_name": "Concatenate", "inbound_nodes": [[["activation_18", 0, 0, {}], ["conv3d_transpose_4", 0, 0, {}]]]}, {"config": {"filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_25", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_25", "class_name": "Conv3D", "inbound_nodes": [["concatenate_4", 0, 0, {}]]}, {"config": {"name": "activation_25", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_25", "class_name": "Activation", "inbound_nodes": [["conv3d_25", 0, 0, {}]]}, {"config": {"filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_26", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_26", "class_name": "Conv3D", "inbound_nodes": [["activation_25", 0, 0, {}]]}, {"config": {"name": "activation_26", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_26", "class_name": "Activation", "inbound_nodes": [["conv3d_26", 0, 0, {}]]}, {"config": {"filters": 64, "kernel_constraint": null, "data_format": "channels_last", "output_padding": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [2, 2, 2], "dtype": "float32", "use_bias": true, "trainable": true, "kernel_size": [2, 2, 2], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_transpose_5", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_transpose_5", "class_name": "Conv3DTranspose", "inbound_nodes": [["activation_26", 0, 0, {}]]}, {"config": {"name": "concatenate_5", "axis": -1, "trainable": true, "dtype": "float32"}, "name": "concatenate_5", "class_name": "Concatenate", "inbound_nodes": [[["activation_16", 0, 0, {}], ["conv3d_transpose_5", 0, 0, {}]]]}, {"config": {"filters": 32, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_27", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_27", "class_name": "Conv3D", "inbound_nodes": [["concatenate_5", 0, 0, {}]]}, {"config": {"name": "activation_27", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_27", "class_name": "Activation", "inbound_nodes": [["conv3d_27", 0, 0, {}]]}, {"config": {"filters": 32, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3, 3], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_28", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_28", "class_name": "Conv3D", "inbound_nodes": [["activation_27", 0, 0, {}]]}, {"config": {"name": "activation_28", "activation": "relu", "trainable": true, "dtype": "float32"}, "name": "activation_28", "class_name": "Activation", "inbound_nodes": [["conv3d_28", 0, 0, {}]]}, {"config": {"filters": 1, "kernel_constraint": null, "data_format": "channels_last", "kernel_size": [1, 1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "strides": [1, 1, 1], "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3d_29", "activation": "linear", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "name": "conv3d_29", "class_name": "Conv3D", "inbound_nodes": [["activation_28", 0, 0, {}]]}, {"config": {"name": "activation_29", "activation": "sigmoid", "trainable": true, "dtype": "float32"}, "name": "activation_29", "class_name": "Activation", "inbound_nodes": [["conv3d_29", 0, 0, {}]]}]}, "class_name": "Model"}, "training_config": {"optimizer_config": {"config": {"learning_rate": 9.999999747378752e-06, "beta_1": 0.8999999761581421, "decay": 0.0, "epsilon": 1.0000000116860974e-07, "beta_2": 0.9990000128746033, "name": "Adam", "amsgrad": false}, "class_name": "Adam"}, "metrics": ["dice_coef"], "sample_weight_mode": null, "loss": "jaccard_loss", "loss_weights": null, "weighted_metrics": null}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "conv3d_15/kernel", "shape": [3, 3, 3, 1, 16], "dtype": "float32"}, {"name": "conv3d_15/bias", "shape": [16], "dtype": "float32"}, {"name": "conv3d_16/kernel", "shape": [3, 3, 3, 16, 32], "dtype": "float32"}, {"name": "conv3d_16/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3d_17/kernel", "shape": [3, 3, 3, 32, 32], "dtype": "float32"}, {"name": "conv3d_17/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3d_18/kernel", "shape": [3, 3, 3, 32, 64], "dtype": "float32"}, {"name": "conv3d_18/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_19/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_19/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_20/kernel", "shape": [3, 3, 3, 64, 128], "dtype": "float32"}, {"name": "conv3d_20/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_21/kernel", "shape": [3, 3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3d_21/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_22/kernel", "shape": [3, 3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3d_22/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3d_23/kernel", "shape": [3, 3, 3, 384, 128], "dtype": "float32"}, {"name": "conv3d_23/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_24/kernel", "shape": [3, 3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3d_24/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_25/kernel", "shape": [3, 3, 3, 192, 64], "dtype": "float32"}, {"name": "conv3d_25/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_26/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_26/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_27/kernel", "shape": [3, 3, 3, 96, 32], "dtype": "float32"}, {"name": "conv3d_27/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3d_28/kernel", "shape": [3, 3, 3, 32, 32], "dtype": "float32"}, {"name": "conv3d_28/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3d_29/kernel", "shape": [1, 1, 1, 32, 1], "dtype": "float32"}, {"name": "conv3d_29/bias", "shape": [1], "dtype": "float32"}, {"name": "conv3d_transpose_3/kernel", "shape": [2, 2, 2, 256, 256], "dtype": "float32"}, {"name": "conv3d_transpose_3/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3d_transpose_4/kernel", "shape": [2, 2, 2, 128, 128], "dtype": "float32"}, {"name": "conv3d_transpose_4/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3d_transpose_5/kernel", "shape": [2, 2, 2, 64, 64], "dtype": "float32"}, {"name": "conv3d_transpose_5/bias", "shape": [64], "dtype": "float32"}]}]}